// if else ============================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
// const a = 10;
// if (a === 10) {
//     console.log("Вірно a=", a);
// } else {
//     console.log("Невірно a=", a);
// }

// тернарний оператор =================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
// const a = 10;
// // a === 10 ? console.log("Вірно") : console.log("Невірно");
// console.log(a === 10 ? "Вірно" : "Невірно");

// цикли for, while ===================
// конструктор switch ==================