// if else ============================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
// const a = 10;
// if (a === 10) {
//     console.log("Вірно a=", a);
// } else {
//     console.log("Невірно a=", a);
// }

// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).
// const min = 0;

// if (min <= 15) {
//   console.log(`${min} належить до першої чверті`);
// } else if (min > 15 && min <= 30) {
//   console.log(`${min} належить до другої чверті`);
// } else if (min > 30 && min <= 45) {
//   console.log(`${min} належить до третьої чверті`);
// } else if (min > 45 && min <= 60) {
//   console.log(`${min} належить до четвертої чверті`);
// } else {
//   console.log(`${min} не належить до проміжку`);
// }
// тернарний оператор =================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
// const a = 10;
// // a === 10 ? console.log("Вірно") : console.log("Невірно");
// console.log(a === 10 ? "Вірно" : "Невірно");

// цикли for, while ===================
// конструктор switch ==================
