// if else ============================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
// const a = 10;
// if (a === 10) {
//     console.log("Вірно a=", a);
// } else {
//     console.log("Невірно a=", a);
// }

// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).
// const min = 0;

// if (min <= 15) {
//   console.log(`${min} належить до першої чверті`);
// } else if (min > 15 && min <= 30) {
//   console.log(`${min} належить до другої чверті`);
// } else if (min > 30 && min <= 45) {
//   console.log(`${min} належить до третьої чверті`);
// } else if (min > 45 && min <= 60) {
//   console.log(`${min} належить до четвертої чверті`);
// } else {
//   console.log(`${min} не належить до проміжку`);
// }
// тернарний оператор =================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.
// const a = 10;
// // a === 10 ? console.log("Вірно") : console.log("Невірно");
// console.log(a === 10 ? "Вірно" : "Невірно");

// цикли for, while ===================
// конструктор switch ==================

// Змінна num може набувати 4 значення: 1, 2, 3 або 4. Якщо вона має
// значення '1', то у змінну result запишемо 'зима', якщо має значення
// '2' - 'весна' і так далі. Розв'яжіть завдання через switch-case.

const num = 0;
let result = "";

switch (num) {
  case 1:
    result = "зима";

    break;
  case 2:
    result = "весна";

    break;
  case 3:
    result = "осінь";

    break;
  case 4:
    result = "літо";

    break;

  default:
    result = "Не являється порою року";
    break;
}
console.log(result);
